server/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."facebook_id" = $1 LIMIT 1  [["facebook_id", 10206524853577849]]
INSERT INTO "users" ("name", "facebook_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Jacob Moyle"], ["facebook_id", 10206524853577849], ["created_at", "2015-06-22 17:05:27.265488"], ["updated_at", "2015-06-22 17:05:27.265488"]]
---
  def create
    # email and password for user no longer needed
    @user = User.find_by(facebook_id: params[:user][:oauth_id])
    if @user
      # Error handling needed. But YOLO.
    else
      @user = User.new(name: params[:user][:oauth_name], facebook_id: params[:user][:oauth_id])
      if @user.save